In [1]:
people = {
    "first": ['Lukasz','John','Jane'],
    "last": ['Kamrowski','Doe','Doe'],
    "email": ['Lukasz310@gmail.com','John.Doe@email.com','Jane.Doe@email.com']
}

In [2]:
people['email']

['Lukasz310@gmail.com', 'John.Doe@email.com', 'Jane.Doe@email.com']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane        Doe   Jane.Doe@email.com

In [6]:
df.iloc[0]

first                 Lukasz
last               Kamrowski
email    Lukasz310@gmail.com
Name: 0, dtype: object

In [7]:
df.loc[0]

first                 Lukasz
last               Kamrowski
email    Lukasz310@gmail.com
Name: 0, dtype: object

In [8]:
df.iloc[[0,2]]

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
2    Jane        Doe   Jane.Doe@email.com

In [9]:
df.loc[[0,2]]

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
2    Jane        Doe   Jane.Doe@email.com

In [10]:
df.iloc[[0,2], [2]]

                 email
0  Lukasz310@gmail.com
2   Jane.Doe@email.com

In [11]:
df.loc[[0,2], 'email']

0    Lukasz310@gmail.com
2     Jane.Doe@email.com
Name: email, dtype: object

In [12]:
df['last'] == 'Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [13]:
filt = (df['last'] == 'Kamrowski') | (df['first'] == 'John')

In [14]:
df.loc[~filt, 'email']

2    Jane.Doe@email.com
Name: email, dtype: object

In [15]:
df.columns = ['first_name', 'last_name', 'email']
df

  first_name  last_name                email
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [16]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME  LAST_NAME                EMAIL
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [17]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME  LAST_NAME                EMAIL
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [18]:
df.columns = [x.lower() for x in df.columns]
df

  first_name  last_name                email
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [19]:
df.loc[2] = ['Jane', 'Smith', 'JaneSmith@email.com']
df

  first_name  last_name                email
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane      Smith  JaneSmith@email.com

In [20]:
df.columns = ['first', 'last', 'email']
df.loc[2, ['last', 'email']] = ['Doe', 'JaneDoe@email.com']
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane        Doe    JaneDoe@email.com

In [21]:
df.loc[2, ['last']] = 'Smith'
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane      Smith    JaneDoe@email.com

In [22]:
df.at[2, 'last'] = 'Doe'
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane        Doe    JaneDoe@email.com

In [23]:
filt = (df['email'] == 'JaneDoe@email.com')
df[filt]

  first last              email
2  Jane  Doe  JaneDoe@email.com

In [24]:
df.columns = ['first', 'last', 'email']
df.loc[1, ["first",'last', 'email']] = ['Jane','Doe', 'JaneDoe@email.com']
df.loc[2, ["first",'last', 'email']] = ['John','Doe', 'JohnDoe@email.com']
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John        Doe    JohnDoe@email.com

In [25]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John      Smith    JohnDoe@email.com

In [26]:
df['email'] = df['email'].str.lower()
df

    first       last                email
0  Lukasz  Kamrowski  lukasz310@gmail.com
1    Jane        Doe    janedoe@email.com
2    John      Smith    johndoe@email.com

In [27]:
 df['email'].apply(len)

0    19
1    17
2    17
Name: email, dtype: int64

In [28]:
def update_email(email):
    return email.upper()

In [29]:
df['email'].apply(update_email)

0    LUKASZ310@GMAIL.COM
1      JANEDOE@EMAIL.COM
2      JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [30]:
df['email'] = df['email'].apply(update_email)
df

    first       last                email
0  Lukasz  Kamrowski  LUKASZ310@GMAIL.COM
1    Jane        Doe    JANEDOE@EMAIL.COM
2    John      Smith    JOHNDOE@EMAIL.COM

In [31]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

    first       last                email
0  Lukasz  Kamrowski  lukasz310@gmail.com
1    Jane        Doe    janedoe@email.com
2    John      Smith    johndoe@email.com

In [32]:
df['first'].map({'Lukasz': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [33]:
df['first'].replace({'Lukasz': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [34]:
df

    first       last                email
0  Lukasz  Kamrowski  lukasz310@gmail.com
1    Jane        Doe    janedoe@email.com
2    John      Smith    johndoe@email.com

In [39]:
df['last'].replace({'Smith': 'Doe'})
df['email'].replace({'lukasz310@gmail.com': 'Lukasz310@gmail.com', 'janedoe@email.com': 'JaneDoe@email.com', 'johndoe@email.com': 'JohnDoe@email.com'})

0    Lukasz310@gmail.com
1      JaneDoe@email.com
2      JohnDoe@email.com
Name: email, dtype: object

In [40]:
df['last'] = df['last'].replace({'Smith': 'Doe'})
df['email'] = df['email'].replace({'lukasz310@gmail.com': 'Lukasz310@gmail.com', 'janedoe@email.com': 'JaneDoe@email.com', 'johndoe@email.com': 'JohnDoe@email.com'})

In [41]:
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John        Doe    JohnDoe@email.com

In [42]:
df['first'] + ' ' + df['last']

0    Lukasz Kamrowski
1            Jane Doe
2            John Doe
dtype: object

In [43]:
df['full_name'] = df['first'] + ' ' + df['last']

In [44]:
df

    first       last                email         full_name
0  Lukasz  Kamrowski  Lukasz310@gmail.com  Lukasz Kamrowski
1    Jane        Doe    JaneDoe@email.com          Jane Doe
2    John        Doe    JohnDoe@email.com          John Doe

In [47]:
df.drop(columns=['first', 'last'], inplace = True)

In [48]:
df

                 email         full_name
0  Lukasz310@gmail.com  Lukasz Kamrowski
1    JaneDoe@email.com          Jane Doe
2    JohnDoe@email.com          John Doe

In [50]:
df['full_name'].str.split(" ", expand = True)

        0          1
0  Lukasz  Kamrowski
1    Jane        Doe
2    John        Doe

In [51]:
df[['first', 'last']] = df['full_name'].str.split(" ", expand = True)

In [52]:
df

                 email         full_name   first       last
0  Lukasz310@gmail.com  Lukasz Kamrowski  Lukasz  Kamrowski
1    JaneDoe@email.com          Jane Doe    Jane        Doe
2    JohnDoe@email.com          John Doe    John        Doe

In [54]:
df.append({'first':'Tony'}, ignore_index=True)

                 email         full_name   first       last
0  Lukasz310@gmail.com  Lukasz Kamrowski  Lukasz  Kamrowski
1    JaneDoe@email.com          Jane Doe    Jane        Doe
2    JohnDoe@email.com          John Doe    John        Doe
3                  NaN               NaN    Tony        NaN

In [56]:
people = {
    "first": ['Tony','Steve'],
    "last": ['Stark','Rogers'],
    "email": ['IronMan@avenge.com','Cap@Avenge.com']
}
df2 =pd.DataFrame(people)

In [57]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@Avenge.com

In [58]:
df.append(df2, ignore_index=True)

                 email         full_name   first       last
0  Lukasz310@gmail.com  Lukasz Kamrowski  Lukasz  Kamrowski
1    JaneDoe@email.com          Jane Doe    Jane        Doe
2    JohnDoe@email.com          John Doe    John        Doe
3   IronMan@avenge.com               NaN    Tony      Stark
4       Cap@Avenge.com               NaN   Steve     Rogers

In [59]:
df = df.append(df2, ignore_index=True)

In [60]:
df

                 email         full_name   first       last
0  Lukasz310@gmail.com  Lukasz Kamrowski  Lukasz  Kamrowski
1    JaneDoe@email.com          Jane Doe    Jane        Doe
2    JohnDoe@email.com          John Doe    John        Doe
3   IronMan@avenge.com               NaN    Tony      Stark
4       Cap@Avenge.com               NaN   Steve     Rogers

In [61]:
df.drop(index=4)

                 email         full_name   first       last
0  Lukasz310@gmail.com  Lukasz Kamrowski  Lukasz  Kamrowski
1    JaneDoe@email.com          Jane Doe    Jane        Doe
2    JohnDoe@email.com          John Doe    John        Doe
3   IronMan@avenge.com               NaN    Tony      Stark

In [62]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                 email         full_name   first       last
0  Lukasz310@gmail.com  Lukasz Kamrowski  Lukasz  Kamrowski
3   IronMan@avenge.com               NaN    Tony      Stark
4       Cap@Avenge.com               NaN   Steve     Rogers

In [74]:
people = {
    "first": ['Lukasz','Jane','John', 'Adam'],
    "last": ['Kamrowski','Doe','Doe', 'Doe'],
    "email": ['Lukasz310@gmail.com','JaneDoe@email.com','JohnDoe@email.com', 'A@email.com']
}

In [75]:
df = pd.DataFrame(people)

In [76]:
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John        Doe    JohnDoe@email.com
3    Adam        Doe          A@email.com

In [77]:
df.sort_values(by='last', ascending=False)

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John        Doe    JohnDoe@email.com
3    Adam        Doe          A@email.com

In [78]:
df.sort_values(by=['last', 'first'], ascending=False)

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
2    John        Doe    JohnDoe@email.com
1    Jane        Doe    JaneDoe@email.com
3    Adam        Doe          A@email.com

In [81]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [82]:
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
3    Adam        Doe          A@email.com
1    Jane        Doe    JaneDoe@email.com
2    John        Doe    JohnDoe@email.com